Repository: havet/TMX2Moses
Catalog: Compiled for java 1.7/example_en-sv-omegat.tmx
Source language: en
Languages: sv

source: A competent translator is not only bilingual but bicultural.
sv: En duktig översättare är inte bara tvåspråkig utan behärskar också två kulturer.

source: A language is not merely a collection of words and of rules of grammar and syntax for generating sentences, but also a vast interconnecting system of connotations and cultural references whose mastery, writes linguist Mario Pei, "comes close to being a lifetime job."
sv: Ett språk är inte bara en samling ord med regler för grammatik och syntax för att skapa meningar, utan också ett omfattande system av konnotationer och kulturella referenser som är förbundna med varandra, vilket enligt lingvisten Mario Pei, "nästan innebär ett livstidsarbete" för att det ska gå att tillfullo behärska.

source: Source: Wikipedia (en) 2014-12-05
sv: Källa: Wikipedia (en) 2014-12-05

source: The complexity of the translator's task cannot be overstated; one author suggests that becoming an accomplished translator — after having already acquired a good basic knowledge of both languages and cultures — may require a minimum of ten years' experience.
sv: Komplexiteten i en översättares uppgift kan inte överdrivas; en författare anser att för att bli en fulländad översättare — efter att redan ha införskaffat en god grundläggande kunskap om båda språken och kulturerna — kan det krävas minst tio års erfarenhet.

source: The translator's role in relation to a text has been compared to that of an artist, e.g., a musician or actor, who interprets a work of art.
sv: En översättares roll i förhållande till en text har jämförts med en artists, t.ex. en musikers eller en skådespelares, som tolkar ett konstverk.

source: Translation, like other arts, inescapably involves choice, and choice implies interpretation.
sv: I likhet med annan konst, innefattar översättning oundvikligen val, och val förutsätter tolkning.

source: Viewed in this light, it is a serious misconception to assume that a person who has fair fluency in two languages will, by virtue of that fact alone, be consistently competent to translate between them.
sv: I ljuset av detta, är det en allvarlig missuppfattning att anta att en person som behärskar två språk hyggligt flytande, enbart på grund av detta skulle vara entydigt kompetent att översätta mellan dem.
